chamber_mrf/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 2.14e-1;    //3.5e-07;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.1;
        value           uniform $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $internalField;
        value           uniform $internalField;
    }
    rotor
    {
        type            omegaWallFunction;
        value           uniform $internalField;
    }
    walls
    {
        type            omegaWallFunction;
        value           uniform $internalField;
    }
}


// ************************************************************************* //
