chamber_mrf/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//extractionMethod     extractFromSurface;

chamber.stl
{
    extractionMethod    extractFromSurface;
    includedAngle       150;
}

//geometricTestOnly    no;
//
//subsetFeatures
//{
//    nonManifoldEdges yes;
//    openEdges        yes;
//}
//
//trimFeatures
//{
//    minElem          0;
//    minLen           0;
//}
//
//writeObj             yes;

// ************************************************************************* //
